foamLia/test/juliabase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    topinside
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topoutside
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottominside
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    bottomoutside
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
